#
#██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗  ██╗░░░██╗░█████╗░░░░░░███╗░░
#██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║  ██║░░░██║██╔══██╗░░░░████║░░
#╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║  ╚██╗░██╔╝██║░░██║░░░██╔██║░░
#░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║  ░╚████╔╝░██║░░██║░░░╚═╝██║░░
#░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║  ░░╚██╔╝░░╚█████╔╝██╗███████╗
#░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝  ░░░╚═╝░░░░╚════╝░╚═╝╚══════╝


TOKEN = ''


# дефолт роли 

# ВАЖНО
# ЕСЛИ ПОСТАВИТЬ 123, ТО РОЛЬ НЕ ИСПОЛЬЗУЕТЬСЯ!!!

# стафф ID

STAFF_ROLE = 123

EVENTS_MOD = 123
MODER = 123
CLANS_STAFF = 123
CONTROL = 123
MAFIA_MOD = 123
TRIBUN_MOD = 123
CLOSE_MOD = 123
CREATIVE = 123
SUPPORT =  123

OTPYSK = 123

# ОТВЕЧАЕТ ЗА ID

OTVE_STAFF = 123
OTVE_EVENTS = 123
OTVE_MODER = 123
OTVE_CLANS = 123
OTVE_CONTROL = 123
OTVE_MAFIA = 123
OTVE_TRIBUN = 123
OTVE_CLOSE = 123
OTVE_CREATIVE = 123
OTVE_SUPPORT = 123

# гендеры ID

UNVERIFY = 123
NEDOPYSK = 123

# КАРТИНКИ!!!

IMAGE = "https://media.discordapp.net/attachments/1107728800361496659/1131164219258187826/info.png" # автор изображение
Q_IMAGE = "https://emojiguide.org/images/emoji/8/42i2qsgsfqz8.png" # если у человека нету аватарки

# Название кнопок

MODERR = "Moderator"
CONTROLL = "Control"
EVENTS = "EventMod"
CLAN = "Clan Staff"
MAFIA = "MafiaMod"
TRIBUNE = "TribuneMod"
CLOSE = "CloseMod"
CREATIVEE = "Creative"
SUPPORTT = "Support"
NO = "Отсутствует"

# ИЕРАРХИЯ

ADMIN = 123
CURATOR = 123
MASTER = 123

PRED = 3 # выговоров для авто-снятия
POINTS = 100 # поинтов за 1 день отпуска
AUTO = 100 # понтов за 1 день работы (если писать 0 то ничего не будет добавляться)

# эмодзи ID

POINTSS = 1107683756942315641

# НЕ ТРОГАТЬ
DATABASE = "main.db"



######### НАБОРЫЫЫЫЫЫЫЫЫЫЫЫЫЫ

# КАРТИНКИ

BACK_IMG = "" # ссылка на изображение при подачи # in v0.2
NABOR_ICON = "https://media.discordapp.net/attachments/1132632306503397396/1137091819977584810/IMG_20230804_213643.jpg" # ссылка на картинку в наборах 
POLOSKA = "https://media.discordapp.net/attachments/774042908718399509/830486108978544680/1111.png"

# КАНАЛЫ

GUILD_ID = 123
NABOR_CHANNEL = 123

MODER_NABOR = 123
SUP_NABOR = 123
TRI_NABOR = 123
EVENTS_NABOR = 123
CLOSE_NABOR = 123
CREATIVE_NABOR = 123
MADIA_NABOR = 123

TEXT = """
     Хотите попасть в наш большой и дружный коллектив?
     Рассмотрите должности нашего стаффа, нажав на кнопку ниже, 
     и выберите ту, которая заинтересует вас.
    """

BLACK_LIST_ROLE = []

# ЭМОДЗИ ID

EMO = "<a:dot:1079337710566772736>"

# ВОПРОСЫ 

Q1 = "Укажите ваше имя и возраст"
O1 = "Например: Георгий, 18 лет"

Q2 = "Твой часовой пояс"
O2 = "Например: МСК"

Q3 = "Если ли у тебя опыт в этой сфере?"
O3 = "Например: Я раньше был Moderator на Shayori"

Q4 = "Назови свои лучшее качества"
O4 = "Я крутой, а вообще без меня бы весь дискорд не смог существовать by T1csti"

Q5 = "Почему мы должны взять вас?"
O5 = "..."

# СОБЕС РОЛЬ ID

SOBES_ROLE_ID = 123